{
    "settings": {
        "plugin": {
            "configure": {
                "app-ui": {
                    "pagetitle": "Look & Feel"
                }
            }
        }
    },
    "leftbar": {
        "settings": {
            "plugin": {
                "configure": {
                    "app-ui": "App UI"
                }
            }
        }
    },
    "plugins": {
        "16": {
            "groups": {
                "UI": "Algemene Applicatie Uitstraling",
                "ImportantMessage": "Belangrijk Bericht Weergeven"
            },
            "help": {
                "intro": {
                    "UI": "Deze plugin groep bezit algemene attributen die gerelateerd zijn met de uitstraling van de applicatie.",
                    "ImportantMessage": "Met behulp van dit kader kan je een belangrijk bericht configureren. Dit bericht zal voor alle gebruikers weergegeven worden in het bovenste gedeelte van de applicatie. De inhoud van het belangrijk bericht is gelimiteerd tot een regel."
                },
                "properties": {
                    "UI": {
                        "appTitle": "De titel van de applicatie. Dit wordt weergegeven in de browser tab van de applicatie web pagina.",
                        "appLogo": "Het logo van de applicatie. Dit logo wordt weergegeven binnen meerdere pagina's van de applicatie (v.b. login scherm, navigatiebar, footer).",
                        "appIcon": "Het icoon van de applicatie. Dit wordt weergegeven in de browser tab van de applicatie web pagina.",
                        "contactLink": "Als gebruikers nood hebben aan ondersteuning of indien ze je willen contacteren zal de applicatie ze refereren naar deze URL. Gebruikers worden automatisch doorverwezen naar deze URL wanneer ze op een ondersteunings- of contactknop klikken. Deze knoppen staan op verschillende pagina's binnen de applicatie."
                    },
                    "ImportantMessage": {
                        "active": "Als dit ingeschakeld is, dan wordt het belangrijk bericht weergegeven voor alle gebruikers. Indien uitgeschakeld wordt het bericht niet weergegeven.",
                        "message": "De inhoud van het belangrijk bericht. Het gebruik van HTML-syntax wordt gesupporteerd, hierdoor kan je de stijl van het belangrijk bericht wijzigen.",
                        "backgroundColor": "De achtergrondkleur van het kader dat gebruikt wordt om het belangrijk bericht weer te geven.",
                        "inAppOnly": "Als dit ingeschakeld is, dan wordt het belangrijk bericht enkel weergegeven voor geauthenticeerde gebruikers (dus enkel op niet publieke pagina's). Indien uitgeschakeld wordt het bericht ook weergegeven op publieke pagina's (voor alle bezoekers)."
                    }
                }
            },
            "UI": {
                "appTitle": "Titel van de applicatie",
                "appLogo": "Logo van de applicatie",
                "appIcon": "Icoon van de applicatie",
                "contactLink": "Contact URL"
            },
            "ImportantMessage": {
                "active": "Actief",
                "message": "Bericht",
                "backgroundColor": "Achtergrondkleur",
                "inAppOnly": "Enkel Geauthenticeerden"
            }
        }
    }
}
